#+TITLE: CREATE CLEAN COFFEE AND CHARDONNAY CORPORA
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Digital Humanities DSC 105 Spring 2023
#+STARTUP:overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
* README

- Download coffee.csv and chardonnay.csv from GitHub to your PC:
  1) [[https://raw.githubusercontent.com/birkenkrahe/tm/main/data/coffee.csv][raw.githubusercontent.com/birkenkrahe/tm/main/data/coffee.csv]]
  2) [[https://raw.githubusercontent.com/birkenkrahe/tm/main/data/chardonnay.csv][raw.githubusercontent.com/birkenkrahe/tm/main/data/chardonnay.csv]]

- Run all code blocks of this file with ~C-c C-v b~
  (same as ~M-x org-babel-execute-buffer~)

* Corpus creation: coffee tweets

This presumes that ~coffee.csv~ resides in the same directory as the
~corpora.org~ file.

#+begin_src R
  library(tm)
  coffee_df <- read.csv("coffee.csv") # dataframe
  coffee_vec <- coffee_df$text # vector
  coffee_src <- VectorSource(coffee_vec) # source
  coffee_corpus <- VCorpus(coffee_src)
  content(coffee_corpus[[998]])
#+end_src

#+RESULTS:
: [1] "How often do you drink coffee? ? Almost everyday when school's in session. http://t.co/tBZkbvyg1C"

* Corpus creation: Chardonnay tweets

This presumes that ~chardonnay.csv~ resides in the same directory as the
~corpora.org~ file.

#+begin_src R
  library(tm)
  chardonnay_df <- read.csv("chardonnay.csv") # dataframe
  chardonnay_vec <- chardonnay_df$text # vector
  chardonnay_src <- VectorSource(chardonnay_vec) # source
  chardonnay_corpus <- VCorpus(chardonnay_src)
  content(chardonnay_corpus[[998]])
#+end_src

#+RESULTS:
: [1] "Sorry why did I need a glass of Chardonnay"

* Define and run coffee corpus cleaning function

#+name: clean_coffee_corpus
#+begin_src R :results silent
  clean_coffee_corpus <- function(corpus) {
    corpus <- tm_map(corpus,
                     removePunctuation)
    corpus <- tm_map(corpus,
                     content_transformer(tolower))
    corpus <- tm_map(corpus,
                     removeWords,
                     words = c(stopwords("en"), "coffee"))
    corpus <- tm_map(corpus,
                     stripWhitespace)
    return(corpus)
  }
  clean_coffee <- clean_coffee_corpus(coffee_corpus)
#+end_src

* Define and run chardonnay corpus cleaning function
  #+name: clean_chardonnay_corpus
  #+begin_src R :results silent
    clean_chardonnay_corpus <- function(corpus) {
      corpus <- tm_map(corpus,
                       removePunctuation)
      corpus <- tm_map(corpus,
                       content_transformer(tolower))
      corpus <- tm_map(corpus,
                       removeWords,
                       words = c(stopwords("en"), "chardonnay"))
      corpus <- tm_map(corpus,
                       stripWhitespace)
      return(corpus)
    }
    clean_chardonnay <- clean_chardonnay_corpus(chardonnay_corpus)
  #+end_src

* Check results: print original and cleaned tweet
  #+begin_src R
    <<clean_coffee_corpus>>
    <<clean_chardonnay_corpus>>
    content(coffee_corpus[[999]])
    content(clean_coffee[[999]])
    content(chardonnay_corpus[[994]])
    content(clean_chardonnay[[994]])
  #+end_src

  #+RESULTS:
  : [1] "First morning coffee after Ramadan http://t.co/ZEu6cl9qGY"
  : [1] "first morning ramadan httptcozeu6cl9qgy"
  : [1] "Climbing Mera Peak in Nepal and having a glass of Chardonnay with my wife and close friends #BucketList"
  : [1] "climbing mera peak nepal glass wife close friends bucketlist"

* Print all R objects
#+begin_src R
  ls()
#+end_src

#+RESULTS:
: character(0)

* Load other R packages:
#+begin_src R
  load_packages <- function() {
    library(tm)
    library(qdap)
    library(SnowballC)
    library(wordcloud)
    search()
  }
  load_packages()
#+end_src

#+RESULTS:
#+begin_example
Loading required package: NLP

Attaching package: 'NLP'

The following object is masked from 'package:httr':

    content

Loading required package: qdapDictionaries
Loading required package: qdapRegex
Loading required package: qdapTools
Loading required package: RColorBrewer

Attaching package: 'qdap'

The following objects are masked from 'package:tm':

    as.DocumentTermMatrix, as.TermDocumentMatrix

The following object is masked from 'package:NLP':

    ngrams

The following objects are masked from 'package:base':

    Filter, proportions

 [1] ".GlobalEnv"               "package:wordcloud"       
 [3] "package:SnowballC"        "package:qdap"            
 [5] "package:RColorBrewer"     "package:qdapTools"       
 [7] "package:qdapRegex"        "package:qdapDictionaries"
 [9] "package:tm"               "package:NLP"             
[11] "ESSR"                     "package:stats"           
[13] "package:graphics"         "package:grDevices"       
[15] "package:utils"            "package:datasets"        
[17] "package:stringr"          "package:httr"            
[19] "package:methods"          "Autoloads"               
[21] "package:base"            
Warning messages:
1: package 'tm' was built under R version 4.2.3 
2: package 'wordcloud' was built under R version 4.2.3
#+end_example
